Map<String, dynamic> animal1 = {
  'name': 'アオサギ',
  'description': '日本で最も大きいサギ。体は灰色で、飛ぶと風切羽の黒が目立つ。成鳥には、頭に黒い冠羽（かんむりばね）がある。よく見ると、眼の上に黒い模様がある。海岸や干潟、川、湖沼、水田などで、魚やカエルなどをとらえて食べる。ほかのサギ類と集団で繁殖することもあるが、アオサギだけのコロニー（集団繁殖地）をつくることが多い。',
  'type': '鳥類',
  'origin': '日本',
  'size': '93cm',
  'image': 'images/animal1.png'
};

Map<String, dynamic> animal2 = {
  'name': 'アカモズ',
  'description': 'モズに似ているが、ひたいと、のどから腹が白い。頭から背、尾は赤茶色。翼には白い模様がない。眼をおおうように、くちばしの根元から黒い線が出る。平地から山地の明るい林やしげった林のふち、やぶのある草原などにすむ。おもに昆虫を食べ、小鳥やカエルなどをおそうことがある。大きいえものは足でつかむが、普通はくちばしでくわえる。環境省のレッドリストの絶滅危惧ⅠB類に指定されている。',
  'type': '鳥類',
  'origin': '日本',
  'size': '20cm',
  'image': 'images/animal2.png'
};

Map<String, dynamic> animal3 = {
  'name': 'アトリ',
  'description': 'カワラヒワより大きい。オスの夏羽は頭が黒い。オスの冬羽とメスの頭は灰色がかったかっ色。飛ぶと、黒い尾と腰の白のパターンが目立つ。山地の林にすみ、地上で草の種子などを食べる。ときには平地の畑や水田などでもえさをとる。年によって数万、数十万羽の群れがやってくることがある。これは繁殖地での個体数の増減に関係がある。',
  'type': '鳥類',
  'origin': '日本',
  'size': '16cm',
  'image': 'images/animal3.png'
};

Map<String, dynamic> animal4 = {
  'name': 'オオヨロイトカゲ',
  'description': '開けた草原にすむ。全身にとげ状のうろこが並び、とくに尾のとげは大きい。後頭部にもとげ状のうろこがあり、まるでよろいを着ているようである。地面に1メートル以上の深い穴を掘り、おどろくと穴に逃げこむ。上体を起こし、太陽に顔をむけてよく日光浴をする。小動物を食べる。胎生（たいせい）で、夏から秋に2頭の幼体を産む。',
  'type': '爬虫類',
  'origin': '南アフリカ',
  'size': '30-40cm',
  'image': 'images/animal4.png'
};

Map<String, dynamic> animal5 = {
  'name': 'アフリカツメガエル',
  'description': 'おもに池や水たまりなどの流れのないところにすむ。後肢の内側の3本の指に黒いつめがあり、このつめで水底の泥を掘ってえさをさがす。舌が退化しているので、えさは前肢でかきこむようにして食べる。体側に魚のような側線がある。早春から晩夏が繁殖期で、卵を1個ずつ水草などに産みつける。幼生は半透明で1対のひげがある。',
  'type': '両生類',
  'origin': 'アフリカ南部',
  'size': '約100mm',
  'image': 'images/animal5.png'
};

Map<String, dynamic> animal6 = {
  'name': 'モンハナシャコ',
  'description': 'シャコの仲間でははでな色彩で、尾扇（びせん）のふち取りの色は深紅。自分の巣穴を持ち昼間はあまり遠出をしないが、泳ぐスピードはかなり速い。エビのはさみに相当する捕脚（ほきゃく）には数本のとげがあり、この部分を使っての強力なパンチは貝がらをも砕くほどだ。夜間に歩き回ってえものを見つけて一撃でしとめる。肉食性でカニやヤドカリもつかまえて食べる。',
  'type': '無脊椎動物',
  'origin': '太平洋・大西洋・インド洋',
  'size': '150mm',
  'image': 'images/animal6.png'
};

//ここでanimals配列を定義
late List<Map<String, dynamic>> animals = [animal1, animal2, animal3, animal4, animal5, animal6];